---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.AirSystemData.Dispose
source: html/8181a1f7-4dc8-91a8-6290-afea467bdce3.htm
---
# Autodesk.Revit.DB.Mechanical.AirSystemData.Dispose Method

Releases all resources used by the AirSystemData

## Syntax (C#)
```csharp
public void Dispose()
```